SOWFA.script/constant/ABLProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          ABLProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"



// Properties of the mesoscale source terms
momentumSourceType       "computed";
temperatureSourceType    "given";

velocityInputType        "speedAndDirection";


//#include "forcingTable"

// Use the source table in the file listed below.
sourceHeightsMomentum
(
    $windHeight
);

sourceTableMomentumX
(
    (    0.0 $U0Mag)
    (90000.0 $U0Mag)
);

sourceTableMomentumY
(
    (    0.0 $dir)
    (90000.0 $dir)
);

sourceTableMomentumZ
(
    (    0.0 0.0)
    (90000.0 0.0)
);

sourceHeightsTemperature
(
    $windHeight
);

sourceTableTemperature
(
    (    0.0 0.0)
    (90000.0 0.0)
);


// Relaxation factors applied when computing sources given desired
// velocity and temperature.
alphaMomentum      0.7;
alphaTemperature   0.7;


// Properties of the Coriolis force
planetaryRotationPeriod   $EarthPeriod;
latitude                  $latitude;

// Statistics gathering input
statisticsOn              $statisticsOn;
statisticsFrequency       $statisticsFrequency;

// ************************************************************************* //
