SOWFA.script/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    lower
    {
        type            wall;
        inGroups        1(wall);
        nFaces          62500;
        startFace       15645500;
    }
    upper
    {
        type            patch;
        nFaces          62500;
        startFace       15708000;
    }
    west
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          21000;
        startFace       15770500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  east;
    }
    east
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          21000;
        startFace       15791500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  west;
    }
    north
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          21000;
        startFace       15812500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  south;
    }
    south
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          21000;
        startFace       15833500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  north;
    }
)

// ************************************************************************* //
