SOWFA.script/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application       ABLSolver;

  libs              ("libSOWFAfiniteVolume.so" "libSOWFAincompressibleLESModels.so");

  startFrom         latestTime;

  startTime         20975.0;

  stopAt            endTime;

  endTime           21000.0;

  deltaT            0.02;

  writeControl      adjustableRunTime;

  writeInterval     1; 

  purgeWrite        0;

  writeFormat       binary;

  writePrecision    8;

  writeCompression  compressed;

  timeFormat        general;

  timePrecision     8;

  runTimeModifiable yes;

  adjustTimeStep    yes;

  maxCo             0.75;

  maxDeltaT         0.2;

// ************************************************************************* //

