SOWFA.script/system/controlDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application       ABLSolver;

  libs              ("libSOWFAfiniteVolume.so" "libSOWFAincompressibleLESModels.so");

  startFrom         latestTime;

  startTime         20000.0;

  stopAt            endTime;

  endTime           20400.0;

  deltaT            0.02;

  writeControl      adjustableRunTime;

  writeInterval     100; 

  purgeWrite        0;

  writeFormat       binary;

  writePrecision    12;

  writeCompression  compressed;

  timeFormat        general;

  timePrecision     12;

  runTimeModifiable yes;

  adjustTimeStep    yes;

  maxCo             0.75;

  maxDeltaT         0.2;

  functions
  {
      sliceDataInstantaneous
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  cell;
          outputControl        adjustableTime;
          writeInterval        0.1;
          surfaceFormat        vtk;
          fields
          (
              U
              T
              p
          );
          surfaces
          (
              slice_horizontal_2
              {
                  type         plane;
                  basePoint    (1500.0 1500.0 90.0);
                  normalVector (0 0 1);
                  triangulate  false;
              }
          );
      }
  }

// ************************************************************************* //

