SOWFA.script/system/sampling/probeData1S
    probe1S
    {
          type                probes;
          functionObjectLibs ("libsampling.so");
          name                probe1;
          outputControl       timeStep;
          outputInterval      1;
          fields
          (
              Rwall
              qwall
          );
          
          probeLocations
          (
                   (2500.001 500.001 0.0)
          );
    }
